satoshikumano/ebisu-cc3200/main.c
    secParams.Key = (signed char*)SECURITY_KEY;
    secParams.KeyLen = strlen(SECURITY_KEY);
    secParams.Type = SECURITY_TYPE;

    lRetVal = sl_WlanConnect((signed char*)SSID_NAME, strlen(SSID_NAME), 0, &secParams, 0);
    ASSERT_ON_ERROR(lRetVal);

    /* Wait */
    while((!IS_CONNECTED(g_ulStatus)) || (!IS_IP_ACQUIRED(g_ulStatus)))
    {
        // Wait for WLAN Event
#ifndef SL_PLATFORM_MULTI_THREADED
        _SlNonOsMainLoopTask();
#endif
    }

    return SUCCESS;

}

static kii_json_parse_result_t prv_json_read_object(
        const char* json,
        size_t json_len,
        kii_json_field_t* fields,
        char error[EMESSAGE_SIZE + 1])
{
    kii_json_t kii_json;
    kii_json_resource_t* resource_pointer = NULL;

    memset(&kii_json, 0, sizeof(kii_json));
    kii_json.resource = resource_pointer;
    kii_json.error_string_buff = error;
    kii_json.error_string_length = EMESSAGE_SIZE + 1;

    return kii_json_read_object(&kii_json, json, json_len, fields);
}

static kii_bool_t prv_get_smartlight_info(prv_smartlight_t* smartlight)
{
    if (osi_LockObjLock(&m_mutex, OSI_WAIT_FOREVER) != OSI_OK) {
        return KII_FALSE;
    }
    smartlight->power = m_smartlight.power;
    smartlight->brightness = m_smartlight.brightness;
    smartlight->color[0] = m_smartlight.color[0];
    smartlight->color[1] = m_smartlight.color[1];
    smartlight->color[2] = m_smartlight.color[2];
    smartlight->color_temperature = m_smartlight.color_temperature;
    if (osi_LockObjUnlock(&m_mutex) != 0) {
        return KII_FALSE;
    }
    return KII_TRUE;
}

static kii_bool_t prv_set_smartlight_info(const prv_smartlight_t* smartlight)
{
    if (osi_LockObjLock(&m_mutex, OSI_WAIT_FOREVER) != OSI_OK) {
        return KII_FALSE;
    }
    m_smartlight.power = smartlight->power;
    m_smartlight.brightness = smartlight->brightness;
    m_smartlight.color[0] = smartlight->color[0];
    m_smartlight.color[1] = smartlight->color[1];
    m_smartlight.color[2] = smartlight->color[2];
    m_smartlight.color_temperature = smartlight->color_temperature;
    if (osi_LockObjUnlock(&m_mutex) != OSI_OK) {
        return KII_FALSE;
    }
    return KII_TRUE;
}

static kii_bool_t action_handler(
        const char* schema,
        int schema_version,
        const char* action_name,
        const char* action_params,
        char error[EMESSAGE_SIZE + 1])
{
    prv_smartlight_t smartlight;

    Report("schema=%s, schema_version=%d, action name=%s, action params=%s %d\n",
            schema, schema_version, action_name, action_params, strlen(action_params));

    if (strcmp(schema, "SmartLightDemo") != 0 && schema_version != 1) {
        Report("invalid schema: %s %d\n", schema, schema_version);
        sprintf(error, "invalid schema: %s %d", schema, schema_version);
        return KII_FALSE;
    }

    memset(&smartlight, 0x00, sizeof(smartlight));
    if (prv_get_smartlight_info(&smartlight) == KII_FALSE) {
        Report("fail to lock.\n");
        strcpy(error, "fail to lock.");
        return KII_FALSE;
    }
    if (strcmp(action_name, "turnPower") == 0) {
        kii_json_field_t fields[2];

        memset(fields, 0x00, sizeof(fields));
        fields[0].path = "/power";
        fields[0].type = KII_JSON_FIELD_TYPE_BOOLEAN;
        fields[1].path = NULL;
        if(prv_json_read_object(action_params, strlen(action_params),
                        fields, error) !=  KII_JSON_PARSE_SUCCESS) {
            Report("invalid turnPower json\n");
            return KII_FALSE;
        }
        smartlight.power = fields[0].field_copy.boolean_value;
    } else if (strcmp(action_name, "setBrightness") == 0) {
        kii_json_field_t fields[2];

        memset(fields, 0x00, sizeof(fields));
        fields[0].path = "/brightness";
        fields[0].type = KII_JSON_FIELD_TYPE_INTEGER;
        fields[1].path = NULL;
        if(prv_json_read_object(action_params, strlen(action_params),
                        fields, error) !=  KII_JSON_PARSE_SUCCESS) {
            Report("invalid brightness json\n");
            return KII_FALSE;
        }
        smartlight.brightness = fields[0].field_copy.int_value;
    } else if (strcmp(action_name, "setColor") == 0) {
        kii_json_field_t fields[4];

        memset(fields, 0x00, sizeof(fields));
        fields[0].path = "/color/[0]";
        fields[0].type = KII_JSON_FIELD_TYPE_INTEGER;
        fields[1].path = "/color/[1]";
        fields[1].type = KII_JSON_FIELD_TYPE_INTEGER;
        fields[2].path = "/color/[2]";
        fields[2].type = KII_JSON_FIELD_TYPE_INTEGER;
        fields[3].path = NULL;
        if(prv_json_read_object(action_params, strlen(action_params),
                         fields, error) !=  KII_JSON_PARSE_SUCCESS) {
            Report("invalid color json\n");
            return KII_FALSE;
        }
        smartlight.color[0] = fields[0].field_copy.int_value;
        smartlight.color[1] = fields[1].field_copy.int_value;
        smartlight.color[2] = fields[2].field_copy.int_value;
    } else if (strcmp(action_name, "setColorTemperature") == 0) {
        kii_json_field_t fields[2];

        memset(fields, 0x00, sizeof(fields));
        fields[0].path = "/colorTemperature";
        fields[0].type = KII_JSON_FIELD_TYPE_INTEGER;
        fields[1].path = NULL;
        if(prv_json_read_object(action_params, strlen(action_params),
                        fields, error) !=  KII_JSON_PARSE_SUCCESS) {
            Report("invalid colorTemperature json\n");
            return KII_FALSE;
        }
        smartlight.color_temperature = fields[0].field_copy.int_value;
    } else {
        Report("invalid action: %s\n", action_name);
        return KII_FALSE;
    }

    if (prv_set_smartlight_info(&smartlight) == KII_FALSE) {
        Report("fail to unlock.\n");
        return KII_FALSE;
    }
    return KII_TRUE;
}

static kii_bool_t state_handler(
        kii_t* kii,
        KII_THING_IF_WRITER writer)
{
    char buf[256];
    prv_smartlight_t smartlight;
    memset(&smartlight, 0x00, sizeof(smartlight));
    if (prv_get_smartlight_info(&smartlight) == KII_FALSE) {
        printf("fail to lock.\n");
        return KII_FALSE;
    }
    if ((*writer)(kii, "{\"power\":") == KII_FALSE) {
        return KII_FALSE;
    }
    if ((*writer)(kii, smartlight.power == KII_JSON_TRUE
                    ? "true," : "false,") == KII_FALSE) {
        return KII_FALSE;
    }
    if ((*writer)(kii, "\"brightness\":") == KII_FALSE) {
        return KII_FALSE;
    }

    sprintf(buf, "%d,", smartlight.brightness);
    if ((*writer)(kii, buf) == KII_FALSE) {
        return KII_FALSE;
    }

    if ((*writer)(kii, "\"color\":") == KII_FALSE) {
        return KII_FALSE;
    }
    sprintf(buf, "[%d,%d,%d],", smartlight.color[0],
            smartlight.color[1], smartlight.color[2]);
    if ((*writer)(kii, buf) == KII_FALSE) {
        return KII_FALSE;
    }

    if ((*writer)(kii, "\"colorTemperature\":") == KII_FALSE) {
        return KII_FALSE;
    }
    sprintf(buf, "%d}", smartlight.color_temperature);
    if ((*writer)(kii, buf) == KII_FALSE) {
        return KII_FALSE;
    }
    return KII_TRUE;
}

void handler_init(
        tio_handler_t* handler,
        char* http_buffer,
        int http_buffer_size,
        void* http_ssl_ctx,
        char* mqtt_buffer,
        int mqtt_buffer_size,
        void* mqtt_ssl_ctx,
        jkii_resource_t* resource)
{
    tio_handler_init(handler);

    tio_handler_set_app(handler, KII_APP_ID, KII_APP_HOST);

    tio_handler_set_cb_push(handler, pushed_message_callback, NULL);

    tio_handler_set_cb_task_create(handler, task_create_cb_impl, NULL);
    tio_handler_set_cb_delay_ms(handler, delay_ms_cb_impl, NULL);

    tio_handler_set_cb_sock_connect_http(handler, sock_cb_connect, http_ssl_ctx);
    tio_handler_set_cb_sock_send_http(handler, sock_cb_send, http_ssl_ctx);
    tio_handler_set_cb_sock_recv_http(handler, sock_cb_recv, http_ssl_ctx);
    tio_handler_set_cb_sock_close_http(handler, sock_cb_close, http_ssl_ctx);

    tio_handler_set_cb_sock_connect_mqtt(handler, sock_cb_connect, mqtt_ssl_ctx);
    tio_handler_set_cb_sock_send_mqtt(handler, sock_cb_send, mqtt_ssl_ctx);
    tio_handler_set_cb_sock_recv_mqtt(handler, sock_cb_recv, mqtt_ssl_ctx);
    tio_handler_set_cb_sock_close_mqtt(handler, sock_cb_close, mqtt_ssl_ctx);

